//Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no»

package by.epam.jb29.task02;

public class Z2 {
    public static void main(String[] args) {
        int a = 2, b = 1;

        if (a < b) {
            System.out.println("yes");
        }
        else {
            System.out.println("no");
        }
    }
}
